Revit 2026 API

# RebarConstraintsManagerSetPreferredConstraintsToSurfaceForHandles Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetPreferredConstraintsToSurfaceForHandles(
	IList<RebarConstrainedHandle> handles
)
```
```vb
Public Sub SetPreferredConstraintsToSurfaceForHandles (
	handles As IList(Of RebarConstrainedHandle)
)
```
```cpp
public:
void SetPreferredConstraintsToSurfaceForHandles(
	IList<RebarConstrainedHandle^>^ handles
)
```
```fsharp
member SetPreferredConstraintsToSurfaceForHandles :
        handles : IList<RebarConstrainedHandle> -> unit
```

#### Parameters

handles IListRebarConstrainedHandle

#### Reference

RebarConstraintsManager Class

Autodesk.Revit.DB.Structure Namespace